%[1]
x1=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
y1=[370.830,710.955,1055.890,1398.603,1728.580,2064.468,2397.483,2734.016,3070.721,3421.397];

plot(x1, y1, '-o', 'LineWidth', 1, ...
                'MarkerEdgeColor', 'k', ...
                'MarkerFaceColor', 'r', ...
                'MarkerSize', 5);

title('文件删除测试');
xlabel('记录数（十万）');
ylabel('耗时（秒）');
axis([0, 11, 200, 5000]);
hold on;

%[2]
x2=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
y2=[418.810,847.425,1272.729,1693.850,2126.292,2557.329,3005.906,3449.551,3917.235,4573.497];

plot(x2, y2, '-o', 'LineWidth', 1, ...
                'MarkerEdgeColor', 'k', ...
                'MarkerFaceColor', 'g', ...
                'MarkerSize', 5);
hold on;

%[3]
x3=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
y3=[414.154,813.430,1214.220,1621.969,2032.979,2437.076,2768.456,3100.208,3430.651,3760.807];

plot(x3, y3, '-o', 'LineWidth', 1, ...
                'MarkerEdgeColor', 'k', ...
                'MarkerFaceColor', 'y', ...
                'MarkerSize', 5);
hold on;
