x1=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
y1=[5.268770,10.139808,14.391026,18.750444,23.847901,28.419808,32.682493,36.840145,41.233320,45.567138];

plot(x1, y1, '-o', 'LineWidth', 1, ...
                'MarkerEdgeColor', 'k', ...
                'MarkerFaceColor', 'r', ...
                'MarkerSize', 5);

title('内存递归测试');
xlabel('记录数（百万）');
ylabel('耗时（秒）');
axis([0, 11, 2, 55]);
hold on;

x2=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
y2=[4.866050,9.449031,14.397720,18.926265,24.445841,28.986159,34.491299,38.880243,43.486521,48.231763];

plot(x2, y2, '-o', 'LineWidth', 1, ...
                'MarkerEdgeColor', 'k', ...
                'MarkerFaceColor', 'g', ...
                'MarkerSize', 5);
hold on;

x3=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
y3=[4.532485,10.021045,14.929680,20.247541,25.046072,30.146118,35.776499,40.383882,45.231450,50.419806];

plot(x3, y3, '-o', 'LineWidth', 1, ...
                'MarkerEdgeColor', 'k', ...
                'MarkerFaceColor', 'y', ...
                'MarkerSize', 5);
hold on;


